> According the API docs you can send a comma separated value for this field in the terraform config. The service team can create a PR to update the field documentation and potentially and example.
> 
> https://cloud.google.com/apigee/docs/reference/apis/apigee/rest/v1/organizations.instances#:~:text=in%20your%20Environments.-,ipRange,-string

That would be great if they could do that. The API field is poorly named it shouldn't be in the singular, but now I have a problem. When I update this field and plan it wants to destroy/recreate. The resource in state doesn't seem to track changes and update with the two values on apply:

```
  # google_apigee_instance.xxx must be replaced
-/+ resource "google_apigee_instance" "xxx" {
      ~ consumer_accept_list     = [
          - "xxxx",
        ] -> (known after apply)
      ~ host                     = "10.100.100.2" -> (known after apply)
      ~ id                       = "organizations/xxxxx/instances/xxx" -> (known after apply)
      ~ ip_range                 = "10.100.100.0/22" -> "10.100.100.0/22, 10.100.200.32/28" # forces replacement
        name                     = "xxxx"
      ~ peering_cidr_range       = "SLASH_22" -> (known after apply)
      ~ port                     = "443" -> (known after apply)
      ~ service_attachment       = "projects/xxxx-tp/regions/us-central1/serviceAttachments/xxxx" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

```

If I reimport it will it have the 2nd value in the string? Or is this an API issue where the state of the object in the actual API has only the value it was created with?
